; Chinese localization for NSIS installer options
; Copyright 2026 hesphoros
; Encoded as UTF-16LE with a BOM: the InstallOptions plugin converts
; non-unicode ini files using the target system's ansi codepage, so a
; unicode ini is required to show these texts correctly on every system.

[Settings]
NumFields=24

[Field 1]
Type=CheckBox
Text=开始菜单快捷方式
State=1
Left=0
Right=140
Top=0
Bottom=13

[Field 2]
Type=GroupBox
Text=文件关联
Left=0
Right=286
Top=13
Bottom=104

[Field 3]
Type=CheckBox
Text=BMP
State=1
Left=6
Right=64
Top=22
Bottom=35

[Field 4]
Type=CheckBox
Text=GIF
State=1
Left=78
Right=136
Top=22
Bottom=35

[Field 5]
Type=CheckBox
Text=ICO
State=1
Left=150
Right=208
Top=22
Bottom=35

[Field 6]
Type=CheckBox
Text=JPEG
State=1
Left=222
Right=280
Top=22
Bottom=35

[Field 7]
Type=CheckBox
Text=JPG
State=1
Left=6
Right=64
Top=35
Bottom=48

[Field 8]
Type=CheckBox
Text=PNG
State=1
Left=78
Right=136
Top=35
Bottom=48

[Field 9]
Type=CheckBox
Text=TIF
State=1
Left=150
Right=208
Top=35
Bottom=48

[Field 10]
Type=CheckBox
Text=TIFF
State=1
Left=222
Right=280
Top=35
Bottom=48

[Field 11]
Type=CheckBox
Text=WEBP
State=1
Left=6
Right=64
Top=48
Bottom=61

[Field 12]
Type=CheckBox
Text=EMF
State=1
Left=78
Right=136
Top=48
Bottom=61

[Field 13]
Type=CheckBox
Text=WMF
State=1
Left=150
Right=208
Top=48
Bottom=61

[Field 15]
Type=CheckBox
Text=AVIF
State=1
Left=222
Right=280
Top=48
Bottom=61

[Field 16]
Type=CheckBox
Text=DDS
State=1
Left=6
Right=64
Top=61
Bottom=74

[Field 17]
Type=CheckBox
Text=HDP
State=1
Left=78
Right=136
Top=61
Bottom=74

[Field 18]
Type=CheckBox
Text=HEIC
State=1
Left=150
Right=208
Top=61
Bottom=74

[Field 19]
Type=CheckBox
Text=HEIF
State=1
Left=222
Right=280
Top=61
Bottom=74

[Field 20]
Type=CheckBox
Text=JXR
State=1
Left=6
Right=64
Top=74
Bottom=87

[Field 21]
Type=CheckBox
Text=QOI
State=1
Left=78
Right=136
Top=74
Bottom=87

[Field 22]
Type=CheckBox
Text=WDP
State=1
Left=150
Right=208
Top=74
Bottom=87

[Field 14]
Type=CheckBox
Text=硬件加速
State=0
Left=140
Right=-1
Top=0
Bottom=13

[Field 23]
Type=Label
Text=AVIF / HEIF / JPEG-XR / DDS 依赖系统 WIC 编解码器
Left=6
Right=286
Top=88
Bottom=98

[Field 24]
Type=Label
Text=硬件加速依赖本机 Direct3D——不支持时安装保持 GDI 软件渲染
Left=6
Right=286
Top=104
Bottom=114
